      *%METADATA                                                       *
      * %TEXT Convert Security Model                                   *
      *%EMETADATA                                                      *
      /copy 'OBJSECMDL/@secmod.rpgleinc'
