      *%METADATA                                                       *
      * %TEXT Global Compiler Directives                               *
      *%EMETADATA                                                      *
     h dftactgrp(*no) actgrp('DOCMGR')
     h copyright('Copyright (c) 2016 Open Text. All rights reserved. +
     hTrademarks owned by Open Text.')
