      /*%METADATA                                                     */
      /* %TEXT Delete my spool files                                  */
      /*%EMETADATA                                                    */
             PGM
             DLTSPLF   FILE(*SELECT)
             ENDPGM
