      /*%METADATA                                                     */
      /* %TEXT test doclink exit                                      */
      /*%EMETADATA                                                    */
             PGM


     dspjoblog








             ENDPGM
