      /*%METADATA                                                     */
      /* %TEXT End User License Tracking Simulation                   */
      /*%EMETADATA                                                    */
             PGM
             CHGDTAARA  DTAARA(QGPL/SIMULTDTA (1 4)) VALUE(STOP)
             ENDPGM
