     d cfgNdxDSS       ds
     d  cfgndx1
     d  cfgndx2
     d  cfgndx3
     d  cfgndx4
     d  cfgndx5
     d  cfgndx6
     d  cfgndx7
     d  cfgNdxA                            like(cfgndx1) dim(7) overlay(cfgndx1)
