      *%METADATA                                                       *
      * %TEXT /COPY Import service program                             *
      *%EMETADATA                                                      *
      * Import service program
      * ---------------------------------------------------------------------- *

      * service program shutdown (close files in all modules)
     d ShutdownIMSSUPP...
     d                 pr
