     c                   do        50
     c                   call      'CRTRPTS'
     c                   parm      '00001'       numRpts           5
     c                   parm      '00005'       numNdxs           5
     c                   enddo
     c                   eval      *inlr = '1'
