             PGM

             QSH        CMD('mv /creditfile/archive/*.* /creditfile/.')

             DLTF       FILE(CREDAPPLOG)

             ENDPGM
