             PGM

             ADDLIBLE   LIB(SKV91IT23)
             ADDLIBLE   LIB(SKD91IT23)

             HLDJOBQ    JOBQ(SPYGLSARC)

             ENDMON

             ENDPGM
