     d dateTime        s               z
      /free
       dateTime = %timestamp('2007-03-11-01.59.00.000000');
       dateTime = dateTime + %minutes(30);
       *inlr = '1';
      /end-free
