                R RMNTRC                    PFILE(RMAINT)
     A          K RRNAM
                R RPTDIR                    PFILE(MRPTDIR)
K1   A          K FLDR
