       dcl-ds cfgNdxDSS;
        cfgndx1;
        cfgndx2;
        cfgndx3;
        cfgndx4;
        cfgndx5;
        cfgndx6;
        cfgndx7;
        cfgNdxA like(cfgndx1) dim(7) overlay(cfgndx1);
       end-ds;
