      /*%METADATA                                                     */
      /* %TEXT Work active job                                        */
      /*%EMETADATA                                                    */
pgm
wrkactjob seq(*cpupct)
endpgm
